---
kind: property
id: P:Autodesk.Revit.DB.ColorOptions.AlertColor
source: html/2f372d5c-9de2-0c8e-80fc-19292bac58e3.htm
---
# Autodesk.Revit.DB.ColorOptions.AlertColor Property

The color of the current canvas theme used to highlight elements when a special alert is required.

## Syntax (C#)
```csharp
public Color AlertColor { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null